// исходный текст программы сохранен в кодировке UTF-8 с сигнатурой

// 608_project15_app.cpp

#include "608_project15_headone.h"
#include "608_project15_headtwo.h" // теперь всё в порядке, ошибки нет
                                   // (благодаря защитному условию в заголовочном
                                   // файле 608_project15_headtwo.h определение
                                   // структуры будет включено в текущий исходный
                                   // только один раз)

int main() {}  // функция main обязательно должна быть определена в одном из файлов
			   // многофайловой программы